[
    {
        "question": "Give me all movies with Tom Cruise.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/All_the_Right_Moves_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Collateral_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Interview_with_the_Vampire_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Outsiders_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Far_and_Away"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Last_Samurai"
            },
            {
                "uri": "http://dbpedia.org/resource/Top_Gun"
            },
            {
                "uri": "http://dbpedia.org/resource/Risky_Business"
            },
            {
                "uri": "http://dbpedia.org/resource/A_Few_Good_Men"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Color_of_Money"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Mummy_(2017_film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Jerry_Maguire"
            },
            {
                "uri": "http://dbpedia.org/resource/Legend_(1985_film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Vanilla_Sky"
            },
            {
                "uri": "http://dbpedia.org/resource/Valkyrie_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Knight_and_Day"
            },
            {
                "uri": "http://dbpedia.org/resource/Lions_for_Lambs"
            },
            {
                "uri": "http://dbpedia.org/resource/Mission:_Impossible_(film_series)"
            },
            {
                "uri": "http://dbpedia.org/resource/Cocktail_(1988_film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Mission:_Impossible_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Born_on_the_Fourth_of_July_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Magnolia_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Firm_(1993_film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Minority_Report_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Rain_Man"
            },
            {
                "uri": "http://dbpedia.org/resource/Losin'_It"
            }
        ]
    },
    {
        "question": "Give me all cities in New Jersey with more than 100000 inhabitants.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Newark,_New_Jersey"
            },
            {
                "uri": "http://dbpedia.org/resource/Jersey_City,_New_Jersey"
            },
            {
                "uri": "http://dbpedia.org/resource/Elizabeth,_New_Jersey"
            },
            {
                "uri": "http://dbpedia.org/resource/Paterson,_New_Jersey"
            }
        ]
    },
    {
        "question": "List the seven kings of Rome.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Tullus_Hostilius"
            },
            {
                "uri": "http://dbpedia.org/resource/Lucius_Tarquinius_Superbus"
            },
            {
                "uri": "http://dbpedia.org/resource/Servius_Tullius"
            },
            {
                "uri": "http://dbpedia.org/resource/Ancus_Marcius"
            },
            {
                "uri": "http://dbpedia.org/resource/Romulus_and_Remus"
            },
            {
                "uri": "http://dbpedia.org/resource/Numa_Pompilius"
            },
            {
                "uri": "http://dbpedia.org/resource/Lucius_Tarquinius_Priscus"
            }
        ]
    },
    {
        "question": "Give me all people that were born in Vienna and died in Berlin.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Michael_von_Newlinsky"
            },
            {
                "uri": "http://dbpedia.org/resource/John_Reinhardt_(director)"
            },
            {
                "uri": "http://dbpedia.org/resource/Heinrich_Ehrlich"
            },
            {
                "uri": "http://dbpedia.org/resource/Emil_von_Reznicek"
            },
            {
                "uri": "http://dbpedia.org/resource/Luise_Begas-Parmentier"
            },
            {
                "uri": "http://dbpedia.org/resource/Adolf_Klein"
            },
            {
                "uri": "http://dbpedia.org/resource/Michael_Meinecke"
            },
            {
                "uri": "http://dbpedia.org/resource/Marie_von_Buelow"
            },
            {
                "uri": "http://dbpedia.org/resource/Irene_Prador"
            },
            {
                "uri": "http://dbpedia.org/resource/Steffie_Spira"
            },
            {
                "uri": "http://dbpedia.org/resource/Alfred_Halm"
            },
            {
                "uri": "http://dbpedia.org/resource/Eduard_von_Winterstein"
            },
            {
                "uri": "http://dbpedia.org/resource/Edmund_Meisel"
            },
            {
                "uri": "http://dbpedia.org/resource/Hilde_K\u00f6rber"
            },
            {
                "uri": "http://dbpedia.org/resource/Eduard_Peithner_von_Lichtenfels"
            },
            {
                "uri": "http://dbpedia.org/resource/Friedrich_Leitner"
            },
            {
                "uri": "http://dbpedia.org/resource/Tilla_Durieux"
            },
            {
                "uri": "http://dbpedia.org/resource/Josef_Rufer"
            },
            {
                "uri": "http://dbpedia.org/resource/Therese_Gr\u00fcnbaum"
            },
            {
                "uri": "http://dbpedia.org/resource/Fritz_Richard"
            },
            {
                "uri": "http://dbpedia.org/resource/Hugo_Flink"
            },
            {
                "uri": "http://dbpedia.org/resource/Alexander_Meissner"
            },
            {
                "uri": "http://dbpedia.org/resource/Grete_von_Zieritz"
            },
            {
                "uri": "http://dbpedia.org/resource/Karl_Etlinger"
            },
            {
                "uri": "http://dbpedia.org/resource/Karl_Hellmer"
            },
            {
                "uri": "http://dbpedia.org/resource/Mathilde_Danegger"
            },
            {
                "uri": "http://dbpedia.org/resource/Robert_Reinert"
            },
            {
                "uri": "http://dbpedia.org/resource/Oscar_Sabo"
            },
            {
                "uri": "http://dbpedia.org/resource/Rudolf_Walther-Fein"
            },
            {
                "uri": "http://dbpedia.org/resource/Willy_Trenk-Trebitsch"
            },
            {
                "uri": "http://dbpedia.org/resource/Guido_von_List"
            },
            {
                "uri": "http://dbpedia.org/resource/Gerda_Laski"
            },
            {
                "uri": "http://dbpedia.org/resource/Karoline_Seidler-Wranitzky"
            },
            {
                "uri": "http://dbpedia.org/resource/Hanna_Berger"
            },
            {
                "uri": "http://dbpedia.org/resource/Leo_Mittler"
            },
            {
                "uri": "http://dbpedia.org/resource/Hans_Fidesser"
            },
            {
                "uri": "http://dbpedia.org/resource/Jacob_Taubes"
            },
            {
                "uri": "http://dbpedia.org/resource/Viktoria_von_Ballasko"
            },
            {
                "uri": "http://dbpedia.org/resource/Richard_Thurnwald"
            },
            {
                "uri": "http://dbpedia.org/resource/Helene_Weigel"
            },
            {
                "uri": "http://dbpedia.org/resource/Johann_Alexander_Hubler-Kahla"
            },
            {
                "uri": "http://dbpedia.org/resource/Johann_Strauss_III"
            },
            {
                "uri": "http://dbpedia.org/resource/Robert_Bodanzky"
            }
        ]
    },
    {
        "question": "Give me all breeds of the German Shepherd dog.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Mancs_(dog)"
            },
            {
                "uri": "http://dbpedia.org/resource/Appollo_(dog)"
            },
            {
                "uri": "http://dbpedia.org/resource/Blondi"
            },
            {
                "uri": "http://dbpedia.org/resource/Lucca_(dog)"
            },
            {
                "uri": "http://dbpedia.org/resource/Lightning_(dog)"
            },
            {
                "uri": "http://dbpedia.org/resource/Antis_(dog)"
            },
            {
                "uri": "http://dbpedia.org/resource/Strongheart"
            },
            {
                "uri": "http://dbpedia.org/resource/Nemo_A534"
            }
        ]
    },
    {
        "question": "Who created Batman?",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Batman dbo:creator ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Bob_Kane"
            },
            {
                "uri": "http://dbpedia.org/resource/Bill_Finger"
            }
        ]
    },
    {
        "question": "Give me all movies directed by Francis Ford Coppola.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/The_Rain_People"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Godfather_Part_III"
            },
            {
                "uri": "http://dbpedia.org/resource/One_from_the_Heart"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Outsiders_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Terror_(1963_film)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Godfather_Part_II"
            },
            {
                "uri": "http://dbpedia.org/resource/Twixt_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Cotton_Club_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Tonight_for_Sure"
            },
            {
                "uri": "http://dbpedia.org/resource/Peggy_Sue_Got_Married"
            },
            {
                "uri": "http://dbpedia.org/resource/Bram_Stoker's_Dracula"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Conversation"
            },
            {
                "uri": "http://dbpedia.org/resource/Rumble_Fish"
            },
            {
                "uri": "http://dbpedia.org/resource/Apocalypse_Now_Redux"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Godfather"
            },
            {
                "uri": "http://dbpedia.org/resource/Youth_Without_Youth_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Finian's_Rainbow_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/Dementia_13"
            },
            {
                "uri": "http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream"
            },
            {
                "uri": "http://dbpedia.org/resource/Gardens_of_Stone"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Rainmaker_(1997_film)"
            },
            {
                "uri": "http://dbpedia.org/resource/You're_a_Big_Boy_Now"
            },
            {
                "uri": "http://dbpedia.org/resource/Tetro"
            },
            {
                "uri": "http://dbpedia.org/resource/New_York_Stories"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Godfather_Saga"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Godfather_(film_series)"
            },
            {
                "uri": "http://dbpedia.org/resource/Battle_Beyond_the_Sun"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls"
            },
            {
                "uri": "http://dbpedia.org/resource/Jack_(1996_film)"
            }
        ]
    },
    {
        "question": "Give me all launch pads operated by NASA.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
            },
            {
                "uri": "http://dbpedia.org/resource/Keweenaw_Rocket_Range"
            },
            {
                "uri": "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
            },
            {
                "uri": "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
            },
            {
                "uri": "http://dbpedia.org/resource/Broglio_Space_Centre"
            },
            {
                "uri": "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
            },
            {
                "uri": "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
            }
        ]
    },
    {
        "question": "List all the musicals with music by Elton John.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/The_Lion_King_(musical)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)"
            },
            {
                "uri": "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
            },
            {
                "uri": "http://dbpedia.org/resource/Lestat_(musical)"
            },
            {
                "uri": "http://dbpedia.org/resource/Aida_(musical)"
            }
        ]
    },
    {
        "question": "List the children of Margaret Thatcher.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Carol_Thatcher"
            },
            {
                "uri": "http://dbpedia.org/resource/Mark_Thatcher"
            }
        ]
    },
    {
        "question": "Give me all actors starring in movies directed by William Shatner.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Tom_Towles"
            },
            {
                "uri": "http://dbpedia.org/resource/Brenda_Bakke"
            },
            {
                "uri": "http://dbpedia.org/resource/William_Shatner"
            },
            {
                "uri": "http://dbpedia.org/resource/George_Takei"
            },
            {
                "uri": "http://dbpedia.org/resource/John_Prosky"
            },
            {
                "uri": "http://dbpedia.org/resource/Duane_Whitaker"
            },
            {
                "uri": "http://dbpedia.org/resource/Dick_Van_Patten"
            },
            {
                "uri": "http://dbpedia.org/resource/Amy_Acker"
            },
            {
                "uri": "http://dbpedia.org/resource/Leonard_Nimoy"
            },
            {
                "uri": "http://dbpedia.org/resource/Rickey_Medlocke"
            },
            {
                "uri": "http://dbpedia.org/resource/Walter_Koenig"
            },
            {
                "uri": "http://dbpedia.org/resource/DeForest_Kelley"
            },
            {
                "uri": "http://dbpedia.org/resource/Dan_Martin_(actor)"
            },
            {
                "uri": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
            },
            {
                "uri": "http://dbpedia.org/resource/J.T._Colosa"
            },
            {
                "uri": "http://dbpedia.org/resource/James_Doohan"
            },
            {
                "uri": "http://dbpedia.org/resource/Dan_Gauthier"
            },
            {
                "uri": "http://dbpedia.org/resource/Nichelle_Nichols"
            }
        ]
    },
    {
        "question": "List all games by GMT.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Washington's_War"
            },
            {
                "uri": "http://dbpedia.org/resource/Fields_of_Fire_(game)"
            },
            {
                "uri": "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
            },
            {
                "uri": "http://dbpedia.org/resource/A_World_At_War"
            },
            {
                "uri": "http://dbpedia.org/resource/Sword_of_Rome"
            },
            {
                "uri": "http://dbpedia.org/resource/Twilight_Struggle"
            },
            {
                "uri": "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
            },
            {
                "uri": "http://dbpedia.org/resource/Chandragupta_(board_game)"
            }
        ]
    },
    {
        "question": "Give me all video games published by Mean Hamster Software.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Crossbow_(video_game)"
            },
            {
                "uri": "http://dbpedia.org/resource/Riven"
            }
        ]
    },
    {
        "question": "Give me all members of Prodigy.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Maxim_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Liam_Howlett"
            },
            {
                "uri": "http://dbpedia.org/resource/Keith_Flint"
            }
        ]
    },
    {
        "question": "Give me the birth place of Frank Sinatra.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Hoboken,_New_Jersey"
            }
        ]
    },
    {
        "question": "Show me all books in Asimov's Foundation series.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/The_Originist"
            },
            {
                "uri": "http://dbpedia.org/resource/Foundation_and_Earth"
            },
            {
                "uri": "http://dbpedia.org/resource/Forward_the_Foundation"
            }
        ]
    },
    {
        "question": "Give me the grandchildren of Elvis Presley.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Riley_Keough"
            }
        ]
    },
    {
        "question": "Give me all books by William Goldman with more than 300 pages.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Marathon_Man_(novel)"
            },
            {
                "uri": "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F"
            },
            {
                "uri": "http://dbpedia.org/resource/Hype_and_Glory"
            },
            {
                "uri": "http://dbpedia.org/resource/Boys_and_Girls_Together"
            },
            {
                "uri": "http://dbpedia.org/resource/Tinsel_(novel)"
            },
            {
                "uri": "http://dbpedia.org/resource/Control_(novel)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Color_of_Light"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Princess_Bride"
            },
            {
                "uri": "http://dbpedia.org/resource/Wait_Till_Next_Year"
            },
            {
                "uri": "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
            }
        ]
    },
    {
        "question": "Show me the book that Muhammad Ali wrote.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/The_Greatest:_My_Own_Story"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
            }
        ]
    },
    {
        "question": "Show me Hemingway's autobiography.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/A_Moveable_Feast"
            }
        ]
    },
    {
        "question": "Give me all Canadian Grunge record labels.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Murderecords"
            }
        ]
    },
    {
        "question": "Give me the currency of China.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:China dbo:currency ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Renminbi"
            }
        ]
    },
    {
        "question": "Give me all Swedish oceanographers.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
            }
        ]
    },
    {
        "question": "Give me all actors starring in Last Action Hero.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Tom_Noonan"
            },
            {
                "uri": "http://dbpedia.org/resource/F._Murray_Abraham"
            },
            {
                "uri": "http://dbpedia.org/resource/Arnold_Schwarzenegger"
            },
            {
                "uri": "http://dbpedia.org/resource/Mercedes_Ruehl"
            },
            {
                "uri": "http://dbpedia.org/resource/Charles_Dance"
            },
            {
                "uri": "http://dbpedia.org/resource/Art_Carney"
            },
            {
                "uri": "http://dbpedia.org/resource/Frank_McRae"
            },
            {
                "uri": "http://dbpedia.org/resource/Austin_O'Brien"
            },
            {
                "uri": "http://dbpedia.org/resource/Robert_Prosky"
            },
            {
                "uri": "http://dbpedia.org/resource/Anthony_Quinn"
            }
        ]
    }
]