[
    {
        "question": "List all boardgames by GMT.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Washington's_War"
            },
            {
                "uri": "http://dbpedia.org/resource/Fields_of_Fire_(game)"
            },
            {
                "uri": "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
            },
            {
                "uri": "http://dbpedia.org/resource/A_World_At_War"
            },
            {
                "uri": "http://dbpedia.org/resource/Sword_of_Rome"
            },
            {
                "uri": "http://dbpedia.org/resource/Twilight_Struggle"
            },
            {
                "uri": "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
            },
            {
                "uri": "http://dbpedia.org/resource/Chandragupta_(board_game)"
            }
        ]
    },
    {
        "question": "Give me all actors starring in movies directed by and starring William Shatner.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Tom_Towles"
            },
            {
                "uri": "http://dbpedia.org/resource/Brenda_Bakke"
            },
            {
                "uri": "http://dbpedia.org/resource/William_Shatner"
            },
            {
                "uri": "http://dbpedia.org/resource/John_Prosky"
            },
            {
                "uri": "http://dbpedia.org/resource/Dan_Martin_(actor)"
            },
            {
                "uri": "http://dbpedia.org/resource/Duane_Whitaker"
            },
            {
                "uri": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
            },
            {
                "uri": "http://dbpedia.org/resource/Dick_Van_Patten"
            },
            {
                "uri": "http://dbpedia.org/resource/J.T._Colosa"
            },
            {
                "uri": "http://dbpedia.org/resource/Dan_Gauthier"
            },
            {
                "uri": "http://dbpedia.org/resource/Amy_Acker"
            },
            {
                "uri": "http://dbpedia.org/resource/Rickey_Medlocke"
            }
        ]
    },
    {
        "question": "Give me the Apollo 14 astronauts.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Stuart_Roosa"
            },
            {
                "uri": "http://dbpedia.org/resource/Alan_Shepard"
            },
            {
                "uri": "http://dbpedia.org/resource/Edgar_Mitchell"
            }
        ]
    },
    {
        "question": "Give me a list of all trumpet players that were bandleaders.",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Terumasa_Hino"
            },
            {
                "uri": "http://dbpedia.org/resource/Adam_Taubitz"
            },
            {
                "uri": "http://dbpedia.org/resource/Jacobo_Rubalcaba"
            },
            {
                "uri": "http://dbpedia.org/resource/Jimmy_Dorsey"
            },
            {
                "uri": "http://dbpedia.org/resource/Pacho_Galan"
            },
            {
                "uri": "http://dbpedia.org/resource/Abatte_Barihun"
            },
            {
                "uri": "http://dbpedia.org/resource/Jimmy_Vivino"
            },
            {
                "uri": "http://dbpedia.org/resource/Billie_Rogers"
            },
            {
                "uri": "http://dbpedia.org/resource/Lloyd_Hunter"
            },
            {
                "uri": "http://dbpedia.org/resource/Hot_Lips_Page"
            },
            {
                "uri": "http://dbpedia.org/resource/Wayne_Bergeron"
            },
            {
                "uri": "http://dbpedia.org/resource/Clifford_Thornton"
            },
            {
                "uri": "http://dbpedia.org/resource/Richard_Maltby,_Sr."
            },
            {
                "uri": "http://dbpedia.org/resource/Doc_Cheatham"
            },
            {
                "uri": "http://dbpedia.org/resource/Ovie_Alston"
            },
            {
                "uri": "http://dbpedia.org/resource/Pete_Brown_(jazz_musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Don_Albert"
            },
            {
                "uri": "http://dbpedia.org/resource/Bobby_Hackett"
            },
            {
                "uri": "http://dbpedia.org/resource/Charlie_Spivak"
            },
            {
                "uri": "http://dbpedia.org/resource/Guy_Barker"
            },
            {
                "uri": "http://dbpedia.org/resource/Neil_Yates"
            },
            {
                "uri": "http://dbpedia.org/resource/Louis_Prima"
            },
            {
                "uri": "http://dbpedia.org/resource/Gerald_Wilson"
            },
            {
                "uri": "http://dbpedia.org/resource/Willie_Mitchell_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Orbert_Davis"
            },
            {
                "uri": "http://dbpedia.org/resource/Sean_Jones_(trumpeter)"
            },
            {
                "uri": "http://dbpedia.org/resource/Henry_Jerome"
            },
            {
                "uri": "http://dbpedia.org/resource/Brad_Turner_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Ollie_Mitchell"
            },
            {
                "uri": "http://dbpedia.org/resource/Artie_Fields"
            },
            {
                "uri": "http://dbpedia.org/resource/Ernest_%22Doc%22_Paulin"
            },
            {
                "uri": "http://dbpedia.org/resource/Mark_Masters_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Erskine_Hawkins"
            },
            {
                "uri": "http://dbpedia.org/resource/Jack_Jackson_(British_radio)"
            },
            {
                "uri": "http://dbpedia.org/resource/Gerard_Presencer"
            },
            {
                "uri": "http://dbpedia.org/resource/Joe_Wilder"
            },
            {
                "uri": "http://dbpedia.org/resource/Doc_Severinsen"
            },
            {
                "uri": "http://dbpedia.org/resource/Alan_Silva"
            },
            {
                "uri": "http://dbpedia.org/resource/Red_Perkins"
            },
            {
                "uri": "http://dbpedia.org/resource/Wingy_Manone"
            },
            {
                "uri": "http://dbpedia.org/resource/Cleveland_Eaton"
            },
            {
                "uri": "http://dbpedia.org/resource/Papa_Celestin"
            },
            {
                "uri": "http://dbpedia.org/resource/Danny_Davis_(country_musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Maynard_Ferguson"
            },
            {
                "uri": "http://dbpedia.org/resource/Theodore_Carpenter"
            },
            {
                "uri": "http://dbpedia.org/resource/Marlon_Jordan"
            }
        ]
    },
    {
        "question": "Give me all writers that won the Nobel Prize in literature.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> ; <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Hermann_Hesse"
            },
            {
                "uri": "http://dbpedia.org/resource/Aleksandr_Solzhenitsyn"
            },
            {
                "uri": "http://dbpedia.org/resource/Ernest_Hemingway"
            },
            {
                "uri": "http://dbpedia.org/resource/Czes\u0142aw_Mi\u0142osz"
            },
            {
                "uri": "http://dbpedia.org/resource/Joseph_Brodsky"
            },
            {
                "uri": "http://dbpedia.org/resource/Jos\u00e9_Saramago"
            },
            {
                "uri": "http://dbpedia.org/resource/Wis\u0142awa_Szymborska"
            },
            {
                "uri": "http://dbpedia.org/resource/John_Steinbeck"
            },
            {
                "uri": "http://dbpedia.org/resource/Gerhart_Hauptmann"
            },
            {
                "uri": "http://dbpedia.org/resource/Eugene_O'Neill"
            },
            {
                "uri": "http://dbpedia.org/resource/Thomas_Mann"
            },
            {
                "uri": "http://dbpedia.org/resource/Toni_Morrison"
            },
            {
                "uri": "http://dbpedia.org/resource/T._S._Eliot"
            },
            {
                "uri": "http://dbpedia.org/resource/Svetlana_Alexievich"
            },
            {
                "uri": "http://dbpedia.org/resource/William_Golding"
            },
            {
                "uri": "http://dbpedia.org/resource/Pablo_Neruda"
            },
            {
                "uri": "http://dbpedia.org/resource/Alice_Munro"
            },
            {
                "uri": "http://dbpedia.org/resource/Patrick_Modiano"
            },
            {
                "uri": "http://dbpedia.org/resource/Juan_Ram\u00f3n_Jim\u00e9nez"
            },
            {
                "uri": "http://dbpedia.org/resource/Harold_Pinter"
            },
            {
                "uri": "http://dbpedia.org/resource/Seamus_Heaney"
            }
        ]
    },
    {
        "question": "Show a list of soccer clubs that play in the Bundesliga.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Borussia_M\u00f6nchengladbach"
            },
            {
                "uri": "http://dbpedia.org/resource/SV_Darmstadt_98"
            },
            {
                "uri": "http://dbpedia.org/resource/FC_Augsburg"
            },
            {
                "uri": "http://dbpedia.org/resource/Bayer_04_Leverkusen"
            },
            {
                "uri": "http://dbpedia.org/resource/VfL_Wolfsburg"
            },
            {
                "uri": "http://dbpedia.org/resource/FC_Ingolstadt_04"
            },
            {
                "uri": "http://dbpedia.org/resource/Eintracht_Frankfurt"
            },
            {
                "uri": "http://dbpedia.org/resource/SC_Freiburg"
            },
            {
                "uri": "http://dbpedia.org/resource/Hertha_BSC"
            },
            {
                "uri": "http://dbpedia.org/resource/1._FC_K\u00f6ln"
            },
            {
                "uri": "http://dbpedia.org/resource/SV_Werder_Bremen"
            },
            {
                "uri": "http://dbpedia.org/resource/1._FSV_Mainz_05"
            },
            {
                "uri": "http://dbpedia.org/resource/FC_Schalke_04"
            },
            {
                "uri": "http://dbpedia.org/resource/RB_Leipzig"
            },
            {
                "uri": "http://dbpedia.org/resource/TSG_1899_Hoffenheim"
            },
            {
                "uri": "http://dbpedia.org/resource/FC_Bayern_Munich"
            },
            {
                "uri": "http://dbpedia.org/resource/Borussia_Dortmund"
            },
            {
                "uri": "http://dbpedia.org/resource/Hamburger_SV"
            }
        ]
    },
    {
        "question": "Give me the capitals of all countries that the Himalayas run through.",
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Thimphu"
            }
        ]
    },
    {
        "question": "Give me all Apollo 14 astronauts.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Stuart_Roosa"
            },
            {
                "uri": "http://dbpedia.org/resource/Alan_Shepard"
            },
            {
                "uri": "http://dbpedia.org/resource/Edgar_Mitchell"
            }
        ]
    },
    {
        "question": "Give me all soccer clubs in the Premier League.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/2012\u201313_Arsenal_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2014\u201315_Chelsea_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2013\u201314_Chelsea_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2010\u201311_Birmingham_City_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2013\u201314_Arsenal_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2007\u201308_Wigan_Athletic_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2007\u201308_Chelsea_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2007\u201308_Manchester_City_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2008\u201309_Manchester_City_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2011\u201312_Chelsea_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2010\u201311_Arsenal_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2014\u201315_Southampton_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2015\u201316_Southampton_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2008\u201309_Arsenal_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2006\u201307_Reading_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2012\u201313_Chelsea_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2012\u201313_Reading_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2009\u201310_Arsenal_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2006\u201307_Bolton_Wanderers_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2013\u201314_Cardiff_City_F.C._season"
            },
            {
                "uri": "http://dbpedia.org/resource/2005\u201306_Wigan_Athletic_F.C._season"
            }
        ]
    },
    {
        "question": "Give me all ESA astronauts.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Dirk_Frimout"
            }
        ]
    },
    {
        "question": "Give me all actors who were born in Berlin.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Dru_Berrymore"
            },
            {
                "uri": "http://dbpedia.org/resource/Tyra_Misoux"
            }
        ]
    },
    {
        "question": "Who created Goofy?",
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Frank_Webb_(cartoonist)"
            },
            {
                "uri": "http://dbpedia.org/resource/Walt_Disney"
            },
            {
                "uri": "http://dbpedia.org/resource/Paul_Murry"
            }
        ]
    },
    {
        "question": "Give me all the TV shows with Neil Patrick Harris.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Capitol_Critters"
            },
            {
                "uri": "http://dbpedia.org/resource/Doogie_Howser,_M.D."
            },
            {
                "uri": "http://dbpedia.org/resource/A_Series_of_Unfortunate_Events_(TV_series)"
            },
            {
                "uri": "http://dbpedia.org/resource/Dr._Horrible's_Sing-Along_Blog"
            },
            {
                "uri": "http://dbpedia.org/resource/Robot_Chicken_DC_Comics_Special"
            },
            {
                "uri": "http://dbpedia.org/resource/Neil's_Puppet_Dreams"
            },
            {
                "uri": "http://dbpedia.org/resource/Snowbound:_The_Jim_and_Jennifer_Stolpa_Story"
            },
            {
                "uri": "http://dbpedia.org/resource/How_I_Met_Your_Mother"
            },
            {
                "uri": "http://dbpedia.org/resource/Joan_of_Arc_(miniseries)"
            },
            {
                "uri": "http://dbpedia.org/resource/Stark_Raving_Mad_(TV_series)"
            },
            {
                "uri": "http://dbpedia.org/resource/Too_Good_to_Be_True_(film)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Christmas_Blessing"
            }
        ]
    },
    {
        "question": "Give me all Swedish holidays.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Gustavus_Adolphus_Day"
            },
            {
                "uri": "http://dbpedia.org/resource/Veterans_Day_(Sweden)"
            },
            {
                "uri": "http://dbpedia.org/resource/St._Knut's_Day"
            },
            {
                "uri": "http://dbpedia.org/resource/Christmas_tree_plundering"
            }
        ]
    },
    {
        "question": "List all the musicals with music by Leonard Bernstein.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Wonderful_Town"
            },
            {
                "uri": "http://dbpedia.org/resource/Candide_(operetta)"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Race_to_Urga"
            },
            {
                "uri": "http://dbpedia.org/resource/1600_Pennsylvania_Avenue_(musical)"
            },
            {
                "uri": "http://dbpedia.org/resource/On_the_Town_(musical)"
            },
            {
                "uri": "http://dbpedia.org/resource/West_Side_Story"
            },
            {
                "uri": "http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green"
            },
            {
                "uri": "http://dbpedia.org/resource/Side_by_Side_by_Sondheim"
            }
        ]
    },
    {
        "question": "Give me all libraries established earlier than 1400.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Nanpura_Parsi_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/Austrian_National_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/Merton_College_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/Library_of_Pergamum"
            },
            {
                "uri": "http://dbpedia.org/resource/Mother_Irene_Gill_Memorial_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/Library_of_Ashurbanipal"
            },
            {
                "uri": "http://dbpedia.org/resource/Cambridge_University_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/National_and_University_Library_of_the_Republika_Srpska"
            },
            {
                "uri": "http://dbpedia.org/resource/Library_of_Alexandria"
            },
            {
                "uri": "http://dbpedia.org/resource/Almeida_Garrett_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/Heidelberg_University_Library"
            },
            {
                "uri": "http://dbpedia.org/resource/Maughan_Library"
            }
        ]
    },
    {
        "question": "List all episodes of the first season of the HBO television series The Sopranos!",
        "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Isabella_(The_Sopranos)"
            },
            {
                "uri": "http://dbpedia.org/resource/Meadowlands_(The_Sopranos)"
            },
            {
                "uri": "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti"
            },
            {
                "uri": "http://dbpedia.org/resource/Boca_(The_Sopranos)"
            },
            {
                "uri": "http://dbpedia.org/resource/Nobody_Knows_Anything"
            },
            {
                "uri": "http://dbpedia.org/resource/Pax_Soprana"
            },
            {
                "uri": "http://dbpedia.org/resource/A_Hit_Is_a_Hit"
            },
            {
                "uri": "http://dbpedia.org/resource/Denial,_Anger,_Acceptance"
            },
            {
                "uri": "http://dbpedia.org/resource/College_(The_Sopranos)"
            },
            {
                "uri": "http://dbpedia.org/resource/46_Long"
            },
            {
                "uri": "http://dbpedia.org/resource/The_Sopranos_(episode)"
            },
            {
                "uri": "http://dbpedia.org/resource/Down_Neck"
            }
        ]
    },
    {
        "question": "Give me a list of all bandleaders that play trumpet.",
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
        "answer": [
            {
                "uri": "http://dbpedia.org/resource/Terumasa_Hino"
            },
            {
                "uri": "http://dbpedia.org/resource/Adam_Taubitz"
            },
            {
                "uri": "http://dbpedia.org/resource/Jacobo_Rubalcaba"
            },
            {
                "uri": "http://dbpedia.org/resource/Jimmy_Dorsey"
            },
            {
                "uri": "http://dbpedia.org/resource/Pacho_Galan"
            },
            {
                "uri": "http://dbpedia.org/resource/Abatte_Barihun"
            },
            {
                "uri": "http://dbpedia.org/resource/Jimmy_Vivino"
            },
            {
                "uri": "http://dbpedia.org/resource/Billie_Rogers"
            },
            {
                "uri": "http://dbpedia.org/resource/Lloyd_Hunter"
            },
            {
                "uri": "http://dbpedia.org/resource/Hot_Lips_Page"
            },
            {
                "uri": "http://dbpedia.org/resource/Wayne_Bergeron"
            },
            {
                "uri": "http://dbpedia.org/resource/Clifford_Thornton"
            },
            {
                "uri": "http://dbpedia.org/resource/Richard_Maltby,_Sr."
            },
            {
                "uri": "http://dbpedia.org/resource/Doc_Cheatham"
            },
            {
                "uri": "http://dbpedia.org/resource/Ovie_Alston"
            },
            {
                "uri": "http://dbpedia.org/resource/Pete_Brown_(jazz_musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Don_Albert"
            },
            {
                "uri": "http://dbpedia.org/resource/Bobby_Hackett"
            },
            {
                "uri": "http://dbpedia.org/resource/Charlie_Spivak"
            },
            {
                "uri": "http://dbpedia.org/resource/Guy_Barker"
            },
            {
                "uri": "http://dbpedia.org/resource/Neil_Yates"
            },
            {
                "uri": "http://dbpedia.org/resource/Louis_Prima"
            },
            {
                "uri": "http://dbpedia.org/resource/Gerald_Wilson"
            },
            {
                "uri": "http://dbpedia.org/resource/Willie_Mitchell_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Orbert_Davis"
            },
            {
                "uri": "http://dbpedia.org/resource/Sean_Jones_(trumpeter)"
            },
            {
                "uri": "http://dbpedia.org/resource/Henry_Jerome"
            },
            {
                "uri": "http://dbpedia.org/resource/Brad_Turner_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Ollie_Mitchell"
            },
            {
                "uri": "http://dbpedia.org/resource/Artie_Fields"
            },
            {
                "uri": "http://dbpedia.org/resource/Ernest_%22Doc%22_Paulin"
            },
            {
                "uri": "http://dbpedia.org/resource/Mark_Masters_(musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Erskine_Hawkins"
            },
            {
                "uri": "http://dbpedia.org/resource/Jack_Jackson_(British_radio)"
            },
            {
                "uri": "http://dbpedia.org/resource/Gerard_Presencer"
            },
            {
                "uri": "http://dbpedia.org/resource/Joe_Wilder"
            },
            {
                "uri": "http://dbpedia.org/resource/Doc_Severinsen"
            },
            {
                "uri": "http://dbpedia.org/resource/Alan_Silva"
            },
            {
                "uri": "http://dbpedia.org/resource/Red_Perkins"
            },
            {
                "uri": "http://dbpedia.org/resource/Wingy_Manone"
            },
            {
                "uri": "http://dbpedia.org/resource/Cleveland_Eaton"
            },
            {
                "uri": "http://dbpedia.org/resource/Papa_Celestin"
            },
            {
                "uri": "http://dbpedia.org/resource/Danny_Davis_(country_musician)"
            },
            {
                "uri": "http://dbpedia.org/resource/Maynard_Ferguson"
            },
            {
                "uri": "http://dbpedia.org/resource/Theodore_Carpenter"
            },
            {
                "uri": "http://dbpedia.org/resource/Marlon_Jordan"
            }
        ]
    }
]